Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 1338, 50)          329050    
_________________________________________________________________
conv1d (Conv1D)              (None, 1334, 256)         64256     
_________________________________________________________________
global_max_pooling1d (Global (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 128)               32896     
_________________________________________________________________
dense_1 (Dense)              (None, 8)                 1032      
=================================================================
Total params: 427,234
Trainable params: 98,184
Non-trainable params: 329,050
_________________________________________________________________
